---
kind: type
id: T:Autodesk.Revit.DB.ParameterTypeId
source: html/58412160-0861-d40d-f1ce-e1f320881d64.htm
---
# Autodesk.Revit.DB.ParameterTypeId

## Syntax (C#)
```csharp
public static class ParameterTypeId
```